#===============================================================
# 书店
#===============================================================
# 书籍列表
books = ["《哈利波特》", "《木偶奇遇记》", "《中国神话故事》",
         "《小王子》", "《编程猫杂志刊》", "《编程漫游指南》",
         "《神秘岛》", "《格兰特船长的儿女》", "《狼图腾》",
         "《窗边的小豆豆》", "《35公斤的希望》", "《父与子》",
         "《读者》", "《偷影子的人》", "《鲁滨逊漂流记》",
         "《80天环游地球》", "《西游记》", "《绿野仙踪》",
         "《海底两万里》", "《永远讲不完的故事》"]
# 打折出售
half_price = {"《木偶奇遇记》", "《编程漫游指南》", "《小王子》",
              "《编程猫杂志刊》", "《海底两万里》"}


#==============================================================
# 顾客
#==============================================================

ls1 = ["《哈利波特》", "《木偶奇遇记》", "《鲁滨逊漂流记》", "《父与子》"]
ls2 = ["《编程猫杂志刊》", "《木偶奇遇记》", "《小王子》"]
ls3 = ["《编程漫游指南》", "《神秘岛》"]
want = set(ls1 + ls2 + ls3)
print('大家喜欢的书：',want)
print("=========================================================")

print("打折参考")
print("大家选了而且还打折的书：",want & half_price)
print("大家选了但不打折的书：",want - half_price)
print("大家没选但打折的书：",half_price - want)
print("=========================================================")

print("重新统计")
print("记得加书名号，输入0统计")
want.clear()
book = ""
while True:
    book = input("请输入书名：")
    if book == '0':
        break
    else:
        want.add(book)
print("一共买了", len(want),"本书")
print(want)
input()
